scr1c/DataProcessors/СинхроДокументыБух.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>СинхроДокументыБух</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

scr1c/Documents/ДокументИзБухгалтерии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ДокументИзБухгалтерии</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетыЗаПроезд</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>333</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>111</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>инфоВерсияДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>33</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

scr1c/DataProcessors/СинхроДокументыБух/Ext/ObjectModule.bsl
Процедура Алга() Экспорт
	
		
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДоговорыКонтрагентов.ссылка) КАК идДог
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов";
	
	Стк = Новый Структура("Догид",Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("идДог")); 
	стк.Вставить("Дт",МАКС(Дата(2024,12,1),НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-2))));
	
	тбл = глОбщий.ДанныеАПИ("SYNHDOCS",Стк);
	
	
	Для каждого Стр из Тбл Цикл
		ссДок = Документы.ДокументИзБухгалтерии.ПолучитьСсылку(стр.идДок);
		Если стрНайти(ссДОк,"не найден")<>0 Тогда
			обк = Документы.ДокументИзБухгалтерии.СоздатьДокумент();
			обк.УстановитьСсылкуНового(ссДок);
		ИНаче
			обк = ссДок.ПолучитьОбъект();
		КонецесЛИ;   
		
		Если СокрлП(Стр.ВерсияДанных)<>"" Тогда
			Если Стр.ВерсияДанных = обк.инфоВерсияДанных Тогда Продолжить; КонецеслИ;
		КонецеслИ;	
		
		
		обк.Дата = стр.Период;
		обк.ПредставлениеДокумента = Стр.док;
		обк.Сумма = Стр.сумма;
		обк.Договор = Справочники.ДоговорыКонтрагентов.ПолучитьСсылку(стр.идДог);
		обк.Контрагент = обк.Договор.Владелец;   
		обк.Содержание = ""+стр.НомерПП+" от "+Лев(СокрЛП(Стр.ДатаПП),10)+" "+Стр.НазначениеПлатежа; 
		обк.инфоВерсияДанных = Стр.ВерсияДанных;
		
		обк.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЦикла;
	
	
	
КонецПроцедуры
